In [4]:
##Assignment 1.1
## Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
import pandas as pd
import numpy as np

# Create a DataFrame with random integers
data = pd.DataFrame(np.random.randint(0,100, size=(6,4)), columns=['A', 'B', 'C', 'D'])
print("Original DataFrame:")
print(data)

Original DataFrame:
    A   B   C   D
0  37  87  85  87
1  41  22  38  83
2  60  90  14  25
3  68  63  35  99
4  70  74  29  93
5  81   1  57  56

In [5]:
# Set the index to be the first column
data.set_index('A', inplace=True)
print("\nDataFrame with 'A' as index:")     
print(data)

DataFrame with 'A' as index:
     B   C   D
A
37  87  85  87
41  22  38  83
60  90  14  25
68  63  35  99
70  74  29  93
81   1  57  56

In [6]:
## Assignment 1.2
#Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.
import pandas as pd
import numpy as np

# Create a DataFrame with random integers
data1_2 = pd. DataFrame(np.random.randint(0,20, size=(3,3)), columns = ['A', 'B', 'C'], index=['X', 'Y', 'Z'])
print("DataFrame for Assignment 1.2:")
print(data1_2)

DataFrame for Assignment 1.2:
    A   B   C
X  17   5   3
Y  14  19  11
Z   7   9  18

In [8]:
data_element = data1_2.loc['Y', 'B']
print(data_element)

19

In [14]:
## Assignment 2.1
import numpy as np
import pandas as pd
data2_1 = pd.DataFrame(np.random.randint(0,50, size=(5,3)), columns=['P', 'Q', 'R'])
print("Original DataFrame for Assignment 2.1:")    
print(data2_1)

Original DataFrame for Assignment 2.1:
    P   Q   R
0  11  21  23
1  20   6  28
2   8  31  13
3  25  34  12
4  42  41  10

In [15]:
data2_1['S'] = data2_1['P'] * data2_1['Q']
print("\nDataFrame after adding column 'S':")       
print(data2_1)

DataFrame after adding column 'S':
    P   Q   R     S
0  11  21  23   231
1  20   6  28   120
2   8  31  13   248
3  25  34  12   850
4  42  41  10  1722

### Alternative solution using fillNa

In [16]:
data2_1['S'] = data2_1[['P','Q']].fillna(data2_1[['P','Q']]).apply(lambda x: x[0] * x[1], axis=1)
print("\nDataFrame after adding column 'S':")
print(data2_1)

DataFrame after adding column 'S':
    P   Q   R     S
0  11  21  23   231
1  20   6  28   120
2   8  31  13   248
3  25  34  12   850
4  42  41  10  1722

/tmp/ipykernel_4398/197165339.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data2_1['S'] = data2_1[['P','Q']].fillna(data2_1[['P','Q']]).apply(lambda x: x[0] * x[1], axis=1)

In [17]:
row_wise_sum = data2_1.sum(axis=1)
print("\nRow-wise sum of the DataFrame:")   
print(row_wise_sum)

Row-wise sum of the DataFrame:
0     286
1     174
2     300
3     921
4    1815
dtype: int64

In [18]:
column_wise_sum = data2_1.sum(axis=0)
print("\nColumn-wise sum of the DataFrame:")    
print(column_wise_sum)

Column-wise sum of the DataFrame:
P     106
Q     133
R      86
S    3171
dtype: int64

In [20]:
## Assignment3
import pandas as pd
import numpy as np
data3 = pd.DataFrame(np.random.randint(0,100, size=(5,3)), columns=['X', 'Y', 'Z'])
print("Original DataFrame for Assignment 3:")    
print(data3)

# Introduce NaN values at random positions
data3.iloc[0, 1] = np.nan  # Row 0, Column Y
data3.iloc[2, 0] = np.nan  # Row 2, Column X
data3.iloc[3, 2] = np.nan  # Row 3, Column Z
data3.iloc[4, 1] = np.nan  # Row 4, Column Y

print("\nDataFrame with NaN values:")
print(data3)

Original DataFrame for Assignment 3:
    X   Y   Z
0  99  65   0
1  34  52  52
2  31  22  57
3  81  13  69
4  57  70  89

DataFrame with NaN values:
      X     Y     Z
0  99.0   NaN   0.0
1  34.0  52.0  52.0
2   NaN  22.0  57.0
3  81.0  13.0   NaN
4  57.0   NaN  89.0

In [21]:
data3.fillna(data3.mean(), inplace=True)
data3

       X     Y     Z
0  99.00  29.0   0.0
1  34.00  52.0  52.0
2  67.75  22.0  57.0
3  81.00  13.0  49.5
4  57.00  29.0  89.0

In [31]:
import pandas as pd
import numpy as np
data3_2 = pd.DataFrame(np.random.randint(0,100, size=(6,4)), columns=['W', 'X', 'Y', 'Z'])
print("Original DataFrame for Assignment 3.2:")    
print(data3_2)

Original DataFrame for Assignment 3.2:
    W   X   Y   Z
0  87  40  79   5
1  18  40  47  32
2  58  31  39  29
3  51  27  20  22
4  35  11  79   8
5   8  51  54  20

In [32]:
data3_2.iloc[2, 0] = np.nan  # Row 2, Column W
data3_2.iloc[3, 2] = np.nan  # Row 3, Column Y
data3_2.iloc[4, 1] = np.nan  # Row 4, Column X
data3_2

      W     X     Y   Z
0  87.0  40.0  79.0   5
1  18.0  40.0  47.0  32
2   NaN  31.0  39.0  29
3  51.0  27.0   NaN  22
4  35.0   NaN  79.0   8
5   8.0  51.0  54.0  20

In [ ]:
#Drop the rows with nan values
data3_2.dropna(inplace=True)
data3_2

      W     X     Y   Z
0  87.0  40.0  79.0   5
1  18.0  40.0  47.0  32
5   8.0  51.0  54.0  20

In [ ]:
#Drop the rows with nan values - alternative approach
data3_2 = data3_2.dropna()
data3_2

      W     X     Y   Z
0  87.0  40.0  79.0   5
1  18.0  40.0  47.0  32
5   8.0  51.0  54.0  20

In [35]:
## Assignment 4
data4_1 = pd.DataFrame({'Category': np.random.choice(['A', 'B', 'C'], size=10),
                        'Values':np.random.randint(1,100, size=10)})
data4_1

  Category  Values
0        B      26
1        A      48
2        B      26
3        B      28
4        B      94
5        C      42
6        B      37
7        A      72
8        B      33
9        A      43

In [36]:
grouped_mean = data4_1.groupby('Category')['Values'].mean()
grouped_mean

Category
A    54.333333
B    40.666667
C    42.000000
Name: Values, dtype: float64

In [37]:
grouped_sum = data4_1.groupby('Category')['Values'].sum()
grouped_sum

Category
A    163
B    244
C     42
Name: Values, dtype: int64

In [38]:
grouped = data4_1.groupby('Category').agg(['mean', 'sum'])
grouped

             Values
               mean  sum
Category
A         54.333333  163
B         40.666667  244
C         42.000000   42

In [39]:
data4_2 = pd.DataFrame({'Product':np.random.choice(['Product1', 'Product2', 'Product3'], size=8),
                        'Category': np.random.choice(['A', 'B', 'C'], size=8),
                        'Sales': np.random.randint(10, 500, size=8)})
data4_2

    Product Category  Sales
0  Product1        A    437
1  Product1        B    233
2  Product3        A     65
3  Product3        C    248
4  Product2        A    392
5  Product3        C    454
6  Product1        C    473
7  Product1        A    359

In [40]:
grouped_sales = data4_2.groupby('Category')['Sales'].sum()
grouped_sales

Category
A    1253
B     233
C    1175
Name: Sales, dtype: int64

In [41]:
# Assignment 5

df5_1_1 = pd.DataFrame({ 'Key': ['A', 'B', 'C', 'D'],
                         'Value1': np.random.randint(1, 50, size=4)})
df5_1_2 = pd.DataFrame({ 'Key': ['B', 'C', 'D', 'E'],
                        'Value2' : np.random.randint(51, 100, size=4)})
print(df5_1_1)
print(df5_1_2)

  Key  Value1
0   A       1
1   B      12
2   C       7
3   D      26
  Key  Value2
0   B      54
1   C      95
2   D      84
3   E      98

In [42]:
pd.merge(df5_1_1, df5_1_2, on='Key', how='inner')

  Key  Value1  Value2
0   B      12      54
1   C       7      95
2   D      26      84

In [45]:
df5_2_1 = pd.DataFrame({ 'Key1': ['A', 'B', 'C', 'D'],
                         'Value1': np.random.randint(1, 50, size=4)})
df5_1_2 = pd.DataFrame({ 'Key2': ['E', 'F', 'G', 'H'],
                        'Value2' : np.random.randint(51, 100, size=4)})
print(df5_2_1)
print(df5_1_2)

  Key1  Value1
0    A       6
1    B      42
2    C      19
3    D      26
  Key2  Value2
0    E      63
1    F      57
2    G      83
3    H      78

In [46]:
concatenated_df_row_wise = pd.concat([df5_2_1, df5_1_2], axis=0)
concatenated_df_row_wise

  Key1  Value1 Key2  Value2
0    A     6.0  NaN     NaN
1    B    42.0  NaN     NaN
2    C    19.0  NaN     NaN
3    D    26.0  NaN     NaN
0  NaN     NaN    E    63.0
1  NaN     NaN    F    57.0
2  NaN     NaN    G    83.0
3  NaN     NaN    H    78.0

In [47]:
concatenated_df_column_wise = pd.concat([df5_2_1, df5_1_2], axis=1)
concatenated_df_column_wise

  Key1  Value1 Key2  Value2
0    A       6    E      63
1    B      42    F      57
2    C      19    G      83
3    D      26    H      78

In [50]:
## Assignment 6: Time Series Analysis
import pandas as pd 
import numpy as np

date_range = pd.date_range(start='2025-01-01', end='2025-12-31', freq='D')
data6_1 = pd.DataFrame(date_range, columns=['Date'])
print(data6_1)

          Date
0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
..         ...
360 2025-12-27
361 2025-12-28
362 2025-12-29
363 2025-12-30
364 2025-12-31

[365 rows x 1 columns]

In [51]:
data6_1['Number'] = np.random.randint(1, 100, size=len(data6_1))
data6_1

          Date  Number
0   2025-01-01      38
1   2025-01-02      35
2   2025-01-03      60
3   2025-01-04      80
4   2025-01-05      26
..         ...     ...
360 2025-12-27      72
361 2025-12-28      28
362 2025-12-29      50
363 2025-12-30      15
364 2025-12-31      87

[365 rows x 2 columns]

In [ ]:
## Resample the data frame to compute the monthly mean
monthly_mean = data6_1.resample('M', on='Date').mean()
monthly_mean

/tmp/ipykernel_4398/1794609995.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_mean = data6_1.resample('M', on='Date').mean()

               Number
Date
2025-01-31  47.548387
2025-02-28  49.821429
2025-03-31  58.354839
2025-04-30  58.566667
2025-05-31  52.967742
2025-06-30  43.033333
2025-07-31  54.451613
2025-08-31  56.000000
2025-09-30  50.700000
2025-10-31  47.838710
2025-11-30  51.366667
2025-12-31  55.193548

In [59]:
date_range_6_2 = pd.date_range(start='2021-01-01', end='2021-12-31', freq='D')
data6_2 = pd.DataFrame(date_range_6_2, columns=['Date'])
data6_2['Value'] = np.random.randint(50, 120, size=len(data6_2))
data6_2.set_index('Date', inplace=True)
data6_2

            Value
Date
2021-01-01     90
2021-01-02    114
2021-01-03     90
2021-01-04     78
2021-01-05     73
...           ...
2021-12-27     53
2021-12-28    108
2021-12-29    102
2021-12-30     84
2021-12-31    116

[365 rows x 1 columns]

In [60]:
# compute rolling mean with a window of 7 days
rolling_mean_7d = data6_2['Value'].rolling(window=7).mean()
rolling_mean_7d

Date
2021-01-01          NaN
2021-01-02          NaN
2021-01-03          NaN
2021-01-04          NaN
2021-01-05          NaN
                ...
2021-12-27    87.571429
2021-12-28    86.857143
2021-12-29    89.714286
2021-12-30    87.714286
2021-12-31    87.428571
Name: Value, Length: 365, dtype: float64

In [62]:
## Assignment 7: Multiindex Dataframe

array_list = [['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(array_list, names = ('Category', 'Subcategory'))
data7_1 = pd.DataFrame(np.random.randint(1,50, size=(4,2)), index=index, columns=['Value1', 'Value2'])
data7_1

                      Value1  Value2
Category Subcategory
A        one              35      13
         two              21      23
B        one              25      17
         two              19       4

In [64]:
data7_1.loc['A']

             Value1  Value2
Subcategory
one              35      13
two              21      23

In [72]:
data7_1.loc[('B','two')]

Value1    19
Value2     4
Name: (B, two), dtype: int64

In [73]:
data7_1.loc[('B','two')]['Value1']

np.int64(19)

In [85]:
new_array_list = [['prod1', 'prod1', 'prod2', 'prod2'], ['type1', 'type2', 'type1', 'type2']]
new_index = pd.MultiIndex.from_arrays(new_array_list, names = ('Category', 'Subcategory'))
data7_2 = (pd.DataFrame(np.random.randint(10, 100, size=(4,2)), index=new_index, columns=['Sales', 'Profit']))
data7_2

                      Sales  Profit
Category Subcategory
prod1    type1           20      65
         type2           61      51
prod2    type1           99      53
         type2           96      42

In [86]:
#Compute sum
grouped_sum = data7_2.groupby(['Category','Subcategory']).sum() 
grouped_sum

                      Sales  Profit
Category Subcategory
prod1    type1           20      65
         type2           61      51
prod2    type1           99      53
         type2           96      42

In [89]:
##Assignment 8
data_range = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')

data8_1 = pd.DataFrame({'Date': np.random.choice(data_range, size= 20),
                       'Category': np.random.choice(['A', 'B', 'C'], size=20),
                       'Sales': np.random.randint(100, 500, size=20)
                      })
data8_1

         Date Category  Sales
0  2023-12-30        B    430
1  2023-07-29        A    387
2  2023-06-27        C    304
3  2023-07-23        C    230
4  2023-08-16        C    145
5  2023-11-01        B    487
6  2023-05-16        B    104
7  2023-11-13        B    208
8  2023-03-22        B    282
9  2023-08-09        C    318
10 2023-06-19        C    349
11 2023-09-21        C    215
12 2023-02-16        B    399
13 2023-12-01        C    227
14 2023-06-14        B    268
15 2023-12-29        C    475
16 2023-06-01        B    322
17 2023-05-28        C    463
18 2023-11-16        A    297
19 2023-06-30        A    175

In [90]:
pivot_table = data8_1.pivot_table(values='Sales', index='Date', columns='Category', aggfunc='sum')
print(pivot_table)

Category        A      B      C
Date
2023-02-16    NaN  399.0    NaN
2023-03-22    NaN  282.0    NaN
2023-05-16    NaN  104.0    NaN
2023-05-28    NaN    NaN  463.0
2023-06-01    NaN  322.0    NaN
2023-06-14    NaN  268.0    NaN
2023-06-19    NaN    NaN  349.0
2023-06-27    NaN    NaN  304.0
2023-06-30  175.0    NaN    NaN
2023-07-23    NaN    NaN  230.0
2023-07-29  387.0    NaN    NaN
2023-08-09    NaN    NaN  318.0
2023-08-16    NaN    NaN  145.0
2023-09-21    NaN    NaN  215.0
2023-11-01    NaN  487.0    NaN
2023-11-13    NaN  208.0    NaN
2023-11-16  297.0    NaN    NaN
2023-12-01    NaN    NaN  227.0
2023-12-29    NaN    NaN  475.0
2023-12-30    NaN  430.0    NaN

In [4]:
##Assignment 8.2
import numpy as np
import pandas as pd

year_range = pd.date_range(start='2015-01-01', end='2024-12-31', freq='YE')

data8_2 = pd.DataFrame({'Date': np.random.choice(year_range, size=20),
                        'Quarter': np.random.choice(['Q1', 'Q2', 'Q3', 'Q4'], size=20),
                        'Revenue': np.random.randint(1000, 10000, size=20)
                        })
data8_2

         Date Quarter  Revenue
0  2020-12-31      Q4     7658
1  2021-12-31      Q1     7246
2  2019-12-31      Q2     1582
3  2016-12-31      Q4     4461
4  2024-12-31      Q3     7368
5  2017-12-31      Q2     3999
6  2018-12-31      Q4     4594
7  2015-12-31      Q1     1126
8  2016-12-31      Q1     4771
9  2023-12-31      Q3     7255
10 2015-12-31      Q1     9105
11 2023-12-31      Q3     6768
12 2018-12-31      Q2     6057
13 2016-12-31      Q2     9447
14 2018-12-31      Q1     9223
15 2017-12-31      Q1     8360
16 2017-12-31      Q3     6240
17 2016-12-31      Q3     6765
18 2016-12-31      Q1     5664
19 2021-12-31      Q1     4653

In [5]:
pivot_table_8_2 = data8_2.pivot_table(values='Revenue', index = 'Date', columns = 'Quarter', aggfunc='mean')
pivot_table_8_2

Quarter         Q1      Q2      Q3      Q4
Date
2015-12-31  5115.5     NaN     NaN     NaN
2016-12-31  5217.5  9447.0  6765.0  4461.0
2017-12-31  8360.0  3999.0  6240.0     NaN
2018-12-31  9223.0  6057.0     NaN  4594.0
2019-12-31     NaN  1582.0     NaN     NaN
2020-12-31     NaN     NaN     NaN  7658.0
2021-12-31  5949.5     NaN     NaN     NaN
2023-12-31     NaN     NaN  7011.5     NaN
2024-12-31     NaN     NaN  7368.0     NaN

In [9]:
## Assignment 9.1
data9_1 = pd.DataFrame({'Values': np.random.randint(1, 100, size=10)})
data9_1

   Values
0      76
1      11
2       4
3      57
4      77
5      86
6      57
7      16
8      57
9      81

In [10]:
## apply a function that doubles the values of the DataFrame
data9_1['Values'] = data9_1.map(lambda x: x + x)
data9_1

   Values
0     152
1      22
2       8
3     114
4     154
5     172
6     114
7      32
8     114
9     162

In [7]:
import numpy as np
import pandas as pd

data9_2 = pd.DataFrame(np.random.randint(1,100, size=(6,3)), columns=['A', 'B', 'C'])
data9_2

    A   B   C
0  71   6  12
1  78  31  49
2  25  99  82
3  26   4  40
4  12  49  81
5  96  17  18

In [8]:
data9_2["Columns_Sum"] = data9_2.apply( lambda x: x.sum(), axis=1)
data9_2

    A   B   C  Columns_Sum
0  71   6  12           89
1  78  31  49          158
2  25  99  82          206
3  26   4  40           70
4  12  49  81          142
5  96  17  18          131

In [9]:
# Alternative approach
data9_2["Columns_Sum1"] = data9_2.sum(axis=1)
data9_2

    A   B   C  Columns_Sum  Columns_Sum1
0  71   6  12           89           178
1  78  31  49          158           316
2  25  99  82          206           412
3  26   4  40           70           140
4  12  49  81          142           284
5  96  17  18          131           262

In [ ]:
## Assignment 10

data10_1_series = pd.Series(['coffee', 'tea', 'juice', 'water', 'soda'])
data10_1_series

0    coffee
1       tea
2     juice
3     water
4      soda
dtype: object

In [11]:
## convert all the srings to uppercase
data10_1_series_str_uppercase = data10_1_series.str.upper()
data10_1_series_str_uppercase

0    COFFEE
1       TEA
2     JUICE
3     WATER
4      SODA
dtype: object

In [12]:
data10_2_series = pd.Series(['coffee', 'tea', 'juice', 'water', 'soda'])
data10_2_series

0    coffee
1       tea
2     juice
3     water
4      soda
dtype: object

In [13]:
# extrac first three characters from each string
data10_2_series_str_extracted = data10_2_series.str[:3]
data10_2_series_str_extracted

0    cof
1    tea
2    jui
3    wat
4    sod
dtype: object